<template>
  <v-container fluid class="search-by">

    <loadingDialog :visible="loadingDialog" />
    <v-snackbar
      app
      left
      transition="scroll-y-reverse-transition"
      v-model="snackbar"
      timeout="5000"
      :color="snackBarColor"
    >
      <p class="white--text ma-0">{{ snackBarText }}</p>
      <template v-slot:action="{ attrs }">
        <v-btn color="white" text v-bind="attrs" @click="snackbar = false">اغلاق</v-btn>
      </template>
    </v-snackbar>
    <v-data-iterator
      :items="items"
      :items-per-page.sync="itemsPerPage"
      :page.sync="page"
      :search="search"
      :sort-by="sortBy.toLowerCase()"
      :sort-desc="sortDesc"
      hide-default-footer
    >
      <template v-slot:header>
        <v-toolbar dark color="success darken-2 " class="mb-1">
          <v-text-field
            v-model="search"
            clearable
            flat
            solo-inverted
            hide-details
            prepend-inner-icon="mdi-magnify"
            label="بحث"
          ></v-text-field>
          <template v-if="$vuetify.breakpoint.mdAndUp">
            <v-spacer></v-spacer>
            <v-select
              v-model="sortBy"
              flat
              solo-inverted
              hide-details
              :items="keys"
              prepend-inner-icon="mdi-magnify"
              label="الترتيب حسب"
              class="blue--text"
            ></v-select>
            <v-spacer></v-spacer>
            <v-btn-toggle v-model="sortDesc" mandatory>
              <v-btn large depressed color="success darken-1" :value="false">
                <v-icon>mdi-arrow-up</v-icon>
              </v-btn>
              <v-btn large depressed color="success darken-1" :value="true">
                <v-icon>mdi-arrow-down</v-icon>
              </v-btn>
            </v-btn-toggle>
          </template>
        </v-toolbar>
      </template>

      <template v-slot:default="props">
        <v-row>
          <v-col v-for="item in props.items" :key="item.الاسم" cols="12" sm="6" md="4" lg="3">
            <v-card>
              <v-card class="d-flex">
                <v-card-title class="subheading font-weight-bold">{{ item.الاسم }}</v-card-title>
              </v-card>

              <v-divider></v-divider>

              <v-list dense>
                <v-list-item v-for="(key, index) in filteredKeys" :key="index">
                  <v-list-item-content :class="{ 'blue--text': sortBy === key }">{{ key }}:</v-list-item-content>
                  <v-list-item-content
                    class="align-end"
                    :class="{ 'blue--text': sortBy === key }"
                  >{{ item[key.toLowerCase()] }}
                  <v-btn
                      @click="copy(item.الرقم_الثاني)"
                      v-if=" (key == 'الرقم_الثاني') && (item.الرقم_الثاني != '') && (item.الرقم_الثاني != ' ')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                  <v-btn
                      @click="copy(item.الرقم)"
                      v-if=" (key == 'الرقم') && (item.الرقم != ' ') && (item.الرقم != '')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                    
                  </v-list-item-content>
                </v-list-item>
              </v-list>
            </v-card>
          </v-col>
        </v-row>
      </template>

      <template v-slot:footer>
        <v-row class="mt-2" align="center" justify="center">
          <span style="color:#1B5E20;">الاطباء لكل صفحة</span>
          <v-menu offset-y>
            <template v-slot:activator="{ on, attrs }">
              <v-btn dark text color="primary" class="ml-2" v-bind="attrs" v-on="on">
                {{ itemsPerPage }}
                <v-icon>mdi-chevron-down</v-icon>
              </v-btn>
            </template>
            <v-list>
              <v-list-item
                v-for="(number, index) in itemsPerPageArray"
                :key="index"
                @click="updateItemsPerPage(number)"
              >
                <v-list-item-title>{{ number }}</v-list-item-title>
              </v-list-item>
            </v-list>
          </v-menu>

          <v-spacer></v-spacer>

          <span class="mr-4" style="color: #1B5E20;">صفحة {{ page }} من {{ numberOfPages }}</span>
          <v-btn fab dark color="success darken-2" class="mr-1" @click="formerPage">
            <v-icon>mdi-chevron-left</v-icon>
          </v-btn>
          <v-btn fab dark color="success darken-2" class="ml-1" @click="nextPage">
            <v-icon>mdi-chevron-right</v-icon>
          </v-btn>
        </v-row>
      </template>
    </v-data-iterator>
  </v-container>
</template>

  <script>
import LoadingDialog from "./LoadingDialog.vue";
export default {
  data() {
    return {
      copyText: "",
      snackbar: false,
      snackBarText: "",
      snackBarColor: "",
      loadingDialog: false,
      overlay: false,
      itemsPerPageArray: [4, 8, 12],
      search: "",
      filter: {},
      sortDesc: false,
      page: 1,
      itemsPerPage: 4,
      sortBy: "Name",
      keys: [
        "الاسم",
        "التخصص",
        "الرقم",
        "الرقم_الثاني",
        "الموقع",
        "اوقات_الدوام"
      ],
      items: [
        {
          الاسم: "مختبر الفياض ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الشفاء الطبي ",
          الرقم: " 07815832970",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " سوبر فارما",
          التخصص: "مختبر/  ",
          الموقع: " مجمع سوبر فارما مقابل كلية طب الفلوجة ",
          الرقم: " ٠٧٨٣١٢١٥٢٥٠",
          الرقم_الثاني: "٠٧٧١٠٣٥٦٩٦٥ ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الرحمن ",
          التخصص: "مختبر/  ",
          الموقع: " مقابل الاسعاف الفوري",
          الرقم: "٠٧٨٢٢٥٦٩٩٧٨ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الزيدي ",
          التخصص: "مختبر/  ",
          الموقع: "مجمع الزيدي مجاور كافتيريا قيس ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الرازي ",
          التخصص: "مختبر/  ",
          الموقع: "مقابل الإسعاف الفوري ",
          الرقم: " ٠٧٨٠١٩٧٠٦٥٠",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر عين الشفاء",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الاندلس عيادة د. صباح منير خلف جامع الراوي",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "صباحا ومساء  "
        },
        {
          الاسم: " مختبر السلام",
          التخصص: "مختبر/  ",
          الموقع: " مجمع د. ابراهيم حامد فتحي ",
          الرقم: " ٠٧٨١٨٦٠٢٠٢٩",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر ادم ",
          التخصص: "مختبر/  ",
          الموقع: " شارع الاسعاف الفوري مجاور الصيدلية الذهيبة",
          الرقم: "٠٧٨٢٢٥٦٩٩٧٨ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر بغداد ",
          التخصص: "مختبر/  ",
          الموقع: "شارع الاسعاف الفوري مجمع صيدلية الحسنى  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر حيفا ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع السلام الطبي مقابل المحكمة القديمة",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر مجمع رفقة",
          التخصص: "مختبر/  ",
          الموقع: " مجاور المستشفى العام ",
          الرقم: " ٠٧٨٠١١٤١٣٤٥",
          الرقم_الثاني: " ",
          اوقات_الدوام: " مساءً"
        },
        {
          الاسم: "مختبر الكندي  ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الانوار المحمدية مقابل كلية طب الفلوجة",

          الرقم: "٠٧٧٠٤٣٦٩٨٨٨ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر اماندا ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الكندي مجاور المستشفى العام قرب الشارع العام",
          الرقم: " ٠٧٨٢٨٣٨٦٢١٩",
          الرقم_الثاني: " ٠٧٧٣١٢٢٢٥٠٥",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الطائي ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الرازي الطبي مقابل كلية طب الفلوجة ",
          الرقم: " ٠٧٨٠٠٩٧٩٦٦٠",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الفارابي",
          التخصص: "مختبر/  ",
          الموقع: "مجمع الفارابي الطبي مقابل كلية طب الفلوجة  ",
          الرقم: " 07817298956",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  مختبر الفا",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الفا الطبي خلف المستشفى العام ",
          الرقم: " 07802770270",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر عين الحياة  ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع عين الحياة مقابل باب الطوارئ للمستشفى العام ",
          الرقم: " ٠٧٨١٩٥٥٠٩٩٠",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الحارثية ",
          التخصص: "مختبر/  ",
          الموقع:
            " مجمع الحارثية الطبي خلف المستشفى العام مقابل الاطراف الصناعية ",
          الرقم: "07814993798 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر مجمع الياقوتة ",
          التخصص: "مختبر/  ",
          الموقع: "مجمع الياقوتة مجاور جامع الحضرة  ",
          الرقم: "٠٧٧٢٣١١٠٧٦٠ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الحميد",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الحياة الطبي مقابل كافتيريا الاكارم",
          الرقم: "٠٧٨٣٠٣٥٨٠٠٠ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الشرق",
          التخصص: "مختبر/  ",
          الموقع: " مجمع السلامة الطبي نزلت جسر الحضرة ",
          الرقم: " ٠٧٨١٨٩٥٦٥٩٦",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر عافية",
          التخصص: "مختبر/  ",
          الموقع: "مجمع عافية  مقابل الاطراف الصناعية  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر المدينة المنورة ",
          التخصص: "مختبر/  ",
          الموقع: "مجمع المدينة المنورة  مقابل كلية طب الفلوجة  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر العلوم الطبية ",
          التخصص: "مختبر/  ",
          الموقع: " خلف المستشفى العام مقابل مجمع الفاو ",
          الرقم: " ٠٧٨٢٦٩٩٢٢٨٠",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الابرار الطبي ",
          التخصص: "مختبر/  ",
          الموقع:
            "مجمع الابرار الطبي مقابل مجمع الفاو الطبي خلف المستشفى العام  ",
          الرقم: "٠٧٨٢٤٨٧٢٧٦١ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " ابراهيم عبد الكريم",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الصدى مقابل كلية طب الفلوجة ",
          الرقم: " ٠٧٩٠٤٥٩٧٢٧٢",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر رويال الطبي",
          التخصص: "مختبر/  ",
          الموقع: " مجمع رويال الطبي مقابل كلية طب الفلوجة ",
          الرقم: " ٠٧٧١٣٤٠٨٧٩١",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الوليد ",
          التخصص: "مختبر/  ",
          الموقع: "مجمع الوليد الطبي مقابل باب الطوارئ للمستشفى العام ",
          الرقم: " ٠٧٨٠٨٤١٨٤٣٥",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الريان ",
          التخصص: "مختبر/  ",
          الموقع: " مقابل باب الطوارئ للمستشفى العام ",
          الرقم: " ٠٧٧٢٦٢٠٦٦١٤",
          الرقم_الثاني: "٠٧٨٠٤١٣١١٥٠ ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الجنى",
          التخصص: "مختبر/  ",
          الموقع: " مجمع ابن النفيس الطبي مقابل الاطراف الصناعية ",
          الرقم: "٠٧٨٠٩٦٠٣٥٣٥ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر دار الشفاء",
          التخصص: "مختبر/  ",
          الموقع: "مجمع دار الشفاء شارع  الاستخبارات مجاور المستشفى العام  ",
          الرقم: " ٠٧٧١٩٧٠٠٠٠٧",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الهلال ",
          التخصص: "مختبر/  ",
          الموقع:
            " مجمع الهلال الطبي شارع الاستخبارات مقابل باب الطوارئ الخلفي للمستشفى العام ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " ",
          التخصص: "مختبر/  ",
          الموقع: " ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر ميديكا",
          التخصص: "مختبر/  ",
          الموقع: "مجمع زيونة الطبي مقابل باب الطوارئ الخلفي للمستشفى العام  ",
          الرقم: " ٠٧٨١٩٤١١٤٨٩",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر النظائر",
          التخصص: "مختبر/  ",
          الموقع:
            "مجمع البلسم الطبي مقابل باب الطوارئ الخلفي  للمستشفى العام  ",
          الرقم: "٠٧٨٠٢٨٣٣٤٨٦ ",
          الرقم_الثاني: "٠٧٨١٩٢٥٣٢٨٥ ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر المنصور  ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع المنصور الطبي مقابل الاطراف الصناعية ",
          الرقم: "٠٧٩٠٣١٥٣٦٩٦ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر روعة  ",
          التخصص: "مختبر/  ",
          الموقع: "مجمع روعة الطبي شارع الاستخبارات قرب الاطراف الصناعية ",
          الرقم: "07817298956 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  مختبر الامانة",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الامانة الطبي شارع الاستخبارات قرب الاطراف الصناعية ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر العادل",
          التخصص: "مختبر/  ",
          الموقع:
            " مجمع العادل الطبي شارع الاستخبارات مقابل مكوى الرداء الابيض",
          الرقم: " ٠٧٨٢٧٩٩٤٠٨٥",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الرحمة",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الرحمة تقاطع حي الشرطة شارع الجيش الشعبي ",
          الرقم: "٠٧٧١٣٤٨٧٠٢٣ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مختبر الخضراء",
          التخصص: "مختبر/  ",
          الموقع: " مجمع الخضراء الطبي مقابل جامع ابو عبيدة",
          الرقم: " ٠٧٨١٥٩٢٥١٣٥",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر الفلوجة ",
          التخصص: "مختبر/  ",
          الموقع: "شارع الاسعاف الفوري مجاور عيادة د. عبد الرحمن الفياض ",
          الرقم: " 07814182807",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر المجد ",
          التخصص: "مختبر/  ",
          الموقع: "  قرب مستشفى الفلوجه_مقابل الاطراف الصناعية- مجمع المجد ",
          الرقم: "07831859999 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  مختبر البشائر الطبي ",
          التخصص: "مختبر/  ",
          الموقع: "شارع ٤٠ مجمع التهاني الطبي مجاور صيدلية تهاني  ",
          الرقم: " 07816912853",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر بيروت ",
          التخصص: "مختبر/  ",
          الموقع:
            " حي الضباط الاولى / مقابل باب الاطراف الاصطناعية لمستشفى الفلوجة التعليمي عمارة المجد الطابق الثالث",

          الرقم: "07700035656 ",
          الرقم_الثاني: "07800035656 ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "مختبر ألين الطبي ",
          التخصص: "مختبر/  ",
          الموقع: " مجمع القمه مقابيل الاطراف الصناعيه الطابق الاول",
          الرقم: "07509390840 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        }
      ]
    };
  },
  components: { LoadingDialog },
  computed: {
    numberOfPages() {
      return Math.ceil(this.items.length / this.itemsPerPage);
    },
    filteredKeys() {
      return this.keys.filter(key => key !== "name");
    }
  },
  methods: {
    nextPage() {
      if (this.page + 1 <= this.numberOfPages) this.page += 1;
    },
    formerPage() {
      if (this.page - 1 >= 1) this.page -= 1;
    },
    updateItemsPerPage(number) {
      this.itemsPerPage = number;
    },
    copy(copyItem) {
      try {
        this.copyText = copyItem;
        if (this.copyText == ".." || this.copyText == ""  ) {
          this.snackbar = true;
          this.snackBarText = "لا يوجد رقم";
          this.snackBarColor = "error";
        } else {
          navigator.clipboard.writeText(this.copyText);
          this.snackbar = true;
          this.snackBarText = "تم نسخ الرقم";
          this.snackBarColor = "success";
        }
      } catch (e) {
        console.log(e);
      }
    }
  }
};
</script>

<style lang="scss">
</style>