<template>
  <v-container fluid class="search-by">
    <loadingDialog :visible="loadingDialog" />
    <v-snackbar
      app
      left
      transition="scroll-y-reverse-transition"
      v-model="snackbar"
      timeout="5000"
      :color="snackBarColor"
    >
      <p class="white--text ma-0">{{ snackBarText }}</p>
      <template v-slot:action="{ attrs }">
        <v-btn color="white" text v-bind="attrs" @click="snackbar = false">اغلاق</v-btn>
      </template>
    </v-snackbar>
    <v-data-iterator
      :items="items"
      :items-per-page.sync="itemsPerPage"
      :page.sync="page"
      :search="search"
      :sort-by="sortBy.toLowerCase()"
      :sort-desc="sortDesc"
      hide-default-footer
    >
      <template v-slot:header>
        <v-toolbar dark color="success darken-2 " class="mb-1">
          <v-text-field
            v-model="search"
            clearable
            flat
            solo-inverted
            hide-details
            prepend-inner-icon="mdi-magnify"
            label="بحث"
          ></v-text-field>
          <template v-if="$vuetify.breakpoint.mdAndUp">
            <v-spacer></v-spacer>
            <v-select
              v-model="sortBy"
              flat
              solo-inverted
              hide-details
              :items="keys"
              prepend-inner-icon="mdi-magnify"
              label="الترتيب حسب"
              class="blue--text"
            ></v-select>
            <v-spacer></v-spacer>
            <v-btn-toggle v-model="sortDesc" mandatory>
              <v-btn large depressed color="success darken-1" :value="false">
                <v-icon>mdi-arrow-up</v-icon>
              </v-btn>
              <v-btn large depressed color="success darken-1" :value="true">
                <v-icon>mdi-arrow-down</v-icon>
              </v-btn>
            </v-btn-toggle>
          </template>
        </v-toolbar>
      </template>

      <template v-slot:default="props">
        <v-row>
          <v-col v-for="item in props.items" :key="item.الاسم" cols="12" sm="6" md="4" lg="3">
            <v-card>
              <v-card class="d-flex">
                <v-card-title class="subheading font-weight-bold">{{ item.الاسم }}</v-card-title>
              </v-card>

              <v-divider></v-divider>

              <v-list dense>
                <v-list-item v-for="(key, index) in filteredKeys" :key="index">
                  <v-list-item-content :class="{ 'blue--text': sortBy === key }">{{ key }}:</v-list-item-content>

                  <v-list-item-content class="align-end" :class="{ 'blue--text': sortBy === key }">
                    {{ item[key.toLowerCase()] }}
                    <v-btn
                      @click="copy(item.الرقم_الثاني)"
                      v-if=" (key == 'الرقم_الثاني') && (item.الرقم_الثاني != '') && (item.الرقم_الثاني != ' ')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                    <v-btn
                      @click="copy(item.الرقم)"
                      v-if="(key == 'الرقم') && (item.الرقم != '') && (item.الرقم != ' ')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                  </v-list-item-content>
                </v-list-item>
              </v-list>
            </v-card>
          </v-col>
        </v-row>
      </template>

      <template v-slot:footer>
        <v-row class="mt-2" align="center" justify="center">
          <span style="color:#1B5E20;">الاطباء لكل صفحة</span>
          <v-menu offset-y>
            <template v-slot:activator="{ on, attrs }">
              <v-btn dark text color="primary" class="ml-2" v-bind="attrs" v-on="on">
                {{ itemsPerPage }}
                <v-icon>mdi-chevron-down</v-icon>
              </v-btn>
            </template>
            <v-list>
              <v-list-item
                v-for="(number, index) in itemsPerPageArray"
                :key="index"
                @click="updateItemsPerPage(number)"
              >
                <v-list-item-title>{{ number }}</v-list-item-title>
              </v-list-item>
            </v-list>
          </v-menu>

          <v-spacer></v-spacer>

          <span class="mr-4" style="color: #1B5E20;">صفحة {{ page }} من {{ numberOfPages }}</span>
          <v-btn fab dark color="success darken-2" class="mr-1" @click="formerPage">
            <v-icon>mdi-chevron-left</v-icon>
          </v-btn>
          <v-btn fab dark color="success darken-2" class="ml-1" @click="nextPage">
            <v-icon>mdi-chevron-right</v-icon>
          </v-btn>
        </v-row>
      </template>
    </v-data-iterator>
  </v-container>
</template>

  <script>
import LoadingDialog from "./LoadingDialog.vue";
export default {
  data() {
    return {
      copyText: "",
      snackbar: false,
      snackBarText: "",
      snackBarColor: "",
      loadingDialog: false,
      overlay: false,
      itemsPerPageArray: [4, 8, 12],
      search: "",
      filter: {},
      sortDesc: false,
      page: 1,
      itemsPerPage: 4,
      sortBy: "Name",
      keys: [
        "الاسم",
        "التخصص",
        "الرقم",
        "الرقم_الثاني",
        "الموقع",
        "اوقات_الدوام"
      ],
      items: [
        {
          الاسم: "عمر صلاح العبيدي",
          التخصص: "طبيب/ جملة عصبية",
          الموقع:
            "مجمع ملائكة الرحمة _مقابل المجمع القديم _مجاور الاسعاف الفوري",
          الرقم: "07810774121",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عبد الواحد صالح",
          التخصص: "طبيب/ جملة عصبية",
          الموقع: "مجمع بيت الدواء مقابل متوسطة ابن خلدون خلف المستشفى العام",
          الرقم: "07819600366",
          الرقم_الثاني: "",
          اوقات_الدوام: "بالفلوجة من الاحد الى الاربعاء , بالرمادي خميس وجمعة"
        },
        {
          الاسم: " حسن فتحي محمد",
          التخصص: "طبيب/ جملة عصبية",
          الموقع: "شارع الاستخبارات مجمع الفلوجة الطبي مجاور مجمع الحارثية",
          الرقم: "07510833108",
          الرقم_الثاني: "07828322234",
          اوقات_الدوام: "من ١٠ صباحا إلى ٨ مساء ,الخميس و الجمعة عطلة فقط"
        },
        {
          الاسم: " اثير احمد عباس",
          التخصص: "طبيب/ جملة عصبية",
          الموقع: "مجمع سوبر فارما الطبي مقابل باب الطوارئ للمستشفى العام",
          الرقم: "07906810271",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام"
        },
        {
          الاسم: " عادل عدنان ياسين",
          التخصص: "طبيب/ جملة عصبية",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ القديم للمستشفى العام",
          الرقم: "07818714467",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "ماهر خاشع العبيدي",
          التخصص: "طبيب/ جملة عصبية",
          الموقع: "مجمع القمة الطبي مقابل الاطراف الصناعية ",
          الرقم: "07821876777",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "لبيد سعد الله الكبيسي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الفاو الطبي خلف المستشفى العام ",
          الرقم: "07800154470",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام ١٠ صباحا, الجمعة عطلة"
        },
        {
          الاسم: "سعد عبد القادر الدراجي",
          التخصص: "طبيب/ جراحة",
          الموقع:
            "مجمع البلسم الطبي . مقابل باب الطورى الخلفي لمستشفى الفلوجه التعليمي ",
          الرقم: "07806799899",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "ضياء مجول شامي المعاضيدي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الهلال الطبي مقابل باب طوارئ القديم المستشفى العام ",
          الرقم: "07832965889",
          الرقم_الثاني: "",
          اوقات_الدوام: "الحجز يومي من ١٠ إلى ٣ ظهرا"
        },
        {
          الاسم: "اياد رحيم عبد الله ",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الرازي الطبي خلف المستشفى العام ",
          الرقم: "٠٧٧١٣٤٠٩٣٨٩",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "اكرم نواف دحل العيساوي ",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الحارثية خلف المستشفى العام ",
          الرقم: "07830481923",
          الرقم_الثاني: "",
          اوقات_الدوام: "الاحد الاثنين الاربعاء والخيمس 9 صباحا"
        },
        {
          الاسم: "صالح حسين العيساوي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع السلامة الطبي خلف جامع الحضرة",
          الرقم: "07810451361",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "اسامة اسماعيل الكبيسي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع عافية خلف المستشفى مقابل الاطراف الصناعية",
          الرقم: "07802840894",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عدنان جيجان عبيد",
          التخصص: "طبيب/ جراحة",
          الموقع: "",
          الرقم: "07823227740",
          الرقم_الثاني: "07803041494",
          اوقات_الدوام: "في الصقلاوية السبت الاثنين, وفي العامرية الأربعاء فقط"
        },
        {
          الاسم: "رائد سعدي العاني",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الامل حي نزال مقابل جامع المكرمين",
          الرقم: "07803475382",
          الرقم_الثاني: "",
          اوقات_الدوام: " ثلاثاء وخميس "
        },
        {
          الاسم: "سلام حسين العلي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع ابن النفيس خلف المستشفى مقابل الاطراف الصناعية",
          الرقم: "٠٧٨١٢٢٠٥٣٠٠",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عبد الهادي مريود المساري",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الفا الطبي خلف المستشفى التعليمي",
          الرقم: "07802771870",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "مصطفى شكيب عبد الرحمن",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع ملائكة الرحمة شارع الإسعاف الفوري",
          الرقم: "07804975930",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " رشيد مجيت الجنابي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع عافية الطبي خلف المستشفى العام مقابل الاطراف الصناعية ",
          الرقم: "٠٧٨٠٣٧٠٧٠٩٦",
          الرقم_الثاني: "",
          اوقات_الدوام: "الحجز برسالة صباحا وبعد ٣ عصرا بالعيادة,الجمعة عطلة "
        },
        {
          الاسم: "هديل محمد سعيد الهلالي ",
          التخصص: "طبيب/ جراحة",
          الموقع:
            "مجمع اسبرين الطبي .مجاور مستشفى الفلوجة العام . مقابل باب المستشفى رقم ٣",
          الرقم: "07840290942",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "علي رافع الجنابي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع صيدلية رفقة الطبي خلف المستشفى العام",
          الرقم: "07807100969",
          الرقم_الثاني: "",
          اوقات_الدوام: "عطلة العيادة الخميس والجمعة "
        },
        {
          الاسم: "أحمد حازم الدراجي",
          التخصص: "طبيب/ جراحة",
          الموقع: "مجمع الروعة الطبي شارع الاستخبارات خلف المستشفى العام ",
          الرقم: "٠٧٨٠٥٢١٢٩٣١",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الثلاثاء والجمعة عطلة"
        },
        {
          الاسم: " يوسف اياد العاني",
          التخصص: "طبيب/ جراحة",
          الموقع: "في مجمع الصدى الطبي قرب مستشفى الفلوجة شارع باب الطوارىء ",
          الرقم: "07814759191",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "مكتوم كوان الاحبابي",
          التخصص: "طبيب/ جراحة",
          الموقع:
            "مجمع البلسم شارع الاستخبارات مقابل البوابة الثالثة لمستشفى الفلوجة ",
          الرقم: "07829079343",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "رباب حامد فرحان ",
          التخصص: "طبيب/ جراحة",
          الموقع:
            "شارع الاستخبارات - مجمع البلسم الطبي-مقابل البوابة الثالثة لمستشفى الفلوجة العام",
          الرقم: "07825304184",
          الرقم_الثاني: "07829079343 ",
          اوقات_الدوام: "السبت والاحد واربعاء وخميس"
        },
        {
          الاسم: "صفاء علي محمد",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الشفاء الطبي ",
          الرقم: "07801943130",
          الرقم_الثاني: "",
          اوقات_الدوام: " الاحد والثلاثاء والخميس"
        },
        {
          الاسم: " شاكر محمود علي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الفلوجة الطبي شارع الاستخبارات مجاور مجمع الحارثية ",
          الرقم: "07805210351",
          الرقم_الثاني: "",
          اوقات_الدوام: "احد خميس عصرا"
        },
        {
          الاسم: "كريم ناجي المحمدي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع السلامة الطبي خلف جامع الحضرة",
          الرقم: "07810451361",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "امير عبد الاله اسماعيل",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع عين الحياة مقابل باب الطوارىء للمستشفى العام ",
          الرقم: "07818990456",
          الرقم_الثاني: "",
          اوقات_الدوام: "احد واربعاء"
        },
        {
          الاسم: "علي خميس السرحان",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الفارابي مقابل باب الطوارىء للمستشفى العام",
          الرقم: "07816854477",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "سيف علي العبيدي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الخضراء مقابل المحكمة القديمة",
          الرقم: "07827420625",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "اصديفان محمد الزوبعي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ القديم للمستشفى العام ",
          الرقم: "07905539954",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "صلاح الدين بديع حسني",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع النور خلف المستشفى العام",
          الرقم: "07810289272",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "علي الجنابي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ القديم للمستشفى العام",
          الرقم: "07738222017",
          الرقم_الثاني: "07829079343",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عبد الرحمن شوكت ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الرازي الطبي مقابل كلية طب الفلوجة ",
          الرقم: "07818541171",
          الرقم_الثاني: "",
          اوقات_الدوام: " احد ثلاثاء خميس"
        },
        {
          الاسم: "سرى مجبل منسي ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الفاو الطبي خلف المستشفى العام",
          الرقم: "07802037868",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: " كاظم جواد حني ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع:
            "مجمع لبنى الطبي حي الشهداء خلف جامع الشمري مقابل مركز صحي الشهداء ",
          الرقم: "07812054625",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "علي محسن المحمدي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الشفاء الطبي مقابل حلويات البستاني ",
          الرقم: "٠٧٨٠٦٤٤٨٢٤٧",
          الرقم_الثاني: "٠٧٨٠٠٠٧٤٣٤٣",
          اوقات_الدوام: "سبت اربعاء خميس عصرا"
        },
        {
          الاسم: "عامر فرحان سليمان",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع:
            "مجمع الحارث الطبي الكائن في شارع الاستخبارات تقاطع جامع المهاجرين",
          الرقم: "07808362686",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " اسامة نايف عبد ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع:
            "مجمع ملائكة الرحمة الطبي شارع العيادة الشعبية مجاور الاسعاف الفوري",
          الرقم: "07804975930",
          الرقم_الثاني: "",
          اوقات_الدوام: "الاثنين عصرا والسبت والخميس صباحا"
        },
        {
          الاسم: " ضفار حميد ياسين ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "شارع الاستخبارات - مجمع الراشد الطبي ",
          الرقم: "07815806479",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "حازم حامد عبد ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع:
            "مجمع الشفاء الطبي خلف المستشفى العام مقابل مركز الاطراف الصناعية",
          الرقم: "07733637735",
          الرقم_الثاني: "07818845112",
          اوقات_الدوام: ""
        },
        {
          الاسم: "علي محمد خلف الجنابي ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع سوبر فارما مقابل كلية طب الفلوجة",
          الرقم: "07830441996",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الاحد والخميس عطلة"
        },
        {
          الاسم: "مركز صدى الصوت",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الرازي الطبي مقابل كلية طب الفلوجة",
          الرقم: "07818541176",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "مصطفى عبدالكريم الانصاري ",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع: "مجمع الهلال مقابل باب الطورى رقم ٣ المستشفى العام",
          الرقم: "٠٧٧١٩٣٨٥٧٠٠",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "حيدر صالح ابراهيم المحمدي",
          التخصص: "طبيب/ انف واذن وحنجرة",
          الموقع:
            "مجمع ملائكة الرحمة الطبي شارع العيادة الشعبية مجاور مركز الاسعاف الفوري ",
          الرقم: "07804975930",
          الرقم_الثاني: "",
          اوقات_الدوام: "عطلة العيادة ثلاثاء واربعاء والجمعة "
        },
        {
          الاسم: "علي جمال",
          التخصص: "طبيب/ علاج طبيعي",
          الموقع: "مجمع الفاو الطبي مقابل كلية طب الفلوجة",
          الرقم: "07824865441",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "احد وثلاثاء وخميس استقبال النساء بكادر نسائي مختص السبت والاثنين والاربعاء رجال "
        },
        {
          الاسم: " المصطفى للعلاج الطبيعي ",
          التخصص: "طبيب/ علاج طبيعي",
          الموقع: "مجمع دار الشفاء مجاور الاطراف الصناعية ",
          الرقم: "٠٧٨١٠٤٤٤٧٤٠",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "  ٤ عصرا احد وثلاثاء وخميس استقبال النساء بكادر نسائي مختص ,السبت والاثنين والاربعاء رجال , الجمعة عطلة"
        },
        {
          الاسم: "قيس العاني",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: "مجمع النور خلف المستشفى العام",
          الرقم: "07903171759",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام 9 صباحاعدا الجمعة عطلة "
        },
        {
          الاسم: "مهند هادي حمادي",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع الكندي مجاور المستشفى العام",
          الرقم: "07818151538",
          الرقم_الثاني: "",
          اوقات_الدوام: " كل الايام يبدأ الساعه 2 ظهرا عدا الجمعة عطلة"
        },
        {
          الاسم: " بلال محمد العاني",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع الفاو خلف المستشفى العام",
          الرقم: "07812321030",
          الرقم_الثاني: "",
          اوقات_الدوام: " كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "عمر محمود شاكر",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: "مجمع الرازي الطبي مقابل كلية طب الفلوجة ",
          الرقم: "07828210114",
          الرقم_الثاني: "",
          اوقات_الدوام: " كل الايام عدا الجمعة والسبت عطلة "
        },
        {
          الاسم: "عمار حميد الهويدي ",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع الخضراء مقابل المحكمة القديمة",
          الرقم: "07821194031",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام يبدأ ١٠ صباحا عدا الجمعة عطلة"
        },
        {
          الاسم: "محمد دهام نايف",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: "مجمع الصدى الطبي مقابل كلية طب الفلوجة خلف المستشفى ",
          الرقم: "07825339787",
          الرقم_الثاني: "",
          اوقات_الدوام: " الاحد والاربعاء "
        },
        {
          الاسم: "سراج هادي محمود",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: "مجمع الفا الطبي خلف المستشفى العام  ",
          الرقم: "٠٧٨٣٤٩٣٢٣٢٢",
          الرقم_الثاني: "",
          اوقات_الدوام: " كل الايام يبدأ  9 صباحا عدا الجمعة عطلة"
        },
        {
          الاسم: "عمر عبد حمود",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع الشفاء الطبي-قرب مطعم حجي حسين",
          الرقم: "07500990912",
          الرقم_الثاني: "07705348082",
          اوقات_الدوام: " الاحد والاثنين صباحا من ٩صباحا لغاية ١٢ظهر"
        },
        {
          الاسم: "ابراهيم مصطفى مرشد",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع الراشد شارع الاستخبارات خلف المستشفى العام",
          الرقم: "07711120871",
          الرقم_الثاني: "",
          اوقات_الدوام: " كل الايام عدا الثلاثاء والجمعة عطلة "
        },
        {
          الاسم: " اسماء صالح الجبوري ",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " مجمع اسبرين الطبي مقابل باب المستشفى رقم 3",
          الرقم: "07850913257",
          الرقم_الثاني: "",
          اوقات_الدوام: " "
        },
        {
          الاسم: "محمد اسماعيل احمد المفرجي",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: " شارع الاستخبارات-مجمع الرواد الطبي ",
          الرقم: "07850111501",
          الرقم_الثاني: "",
          اوقات_الدوام: " "
        },
        {
          الاسم: "بيار عبدالله احمد ",
          التخصص: "طبيب/ جراحة بولية ",
          الموقع: "مجمع الفاو الطبي خلف المستشفى العام ",
          الرقم: "07841972427",
          الرقم_الثاني: "",
          اوقات_الدوام: " الأحد والثلاثاء من كل اسبوع "
        },
        {
          الاسم: "عطور طه الجميلي ",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع الشفاء الطبي",
          الرقم: "07712849498 ",
          الرقم_الثاني: "07810748248",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "حسن محمد فتيح",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع الدله شارع الاستخبارات خلف المستشفى العام ",
          الرقم: "07813171707",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام من ١٢ الى ٧ مساء عدا الجمعة عطلة"
        },
        {
          الاسم: "أصيل الياسين ",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع:
            "مجمع_عين_الحياة_الطبي مقابل باب الطوارىء لمستشفى الفلوجه التعليمي",
          الرقم: "07814431530",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام  يبدأ من ٩ صباحا الجمعة والثلاثاء عطلة "
        },
        {
          الاسم: "اسماء ابراهيم العجيل",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع الكرادة الطبي مقابل باب الطوارئ للمستشفى العام ",
          الرقم: "07830447012",
          الرقم_الثاني: "07830068837",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "هشام صالح الكبيسي",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع عافية مقابل الأطراف الصناعية خلف المستشفى",
          الرقم: "07723105553",
          الرقم_الثاني: "07808125981",
          اوقات_الدوام: "كل الايام من ٣ الى ٧ مساء عدا الجمعة عطلة"
        },
        {
          الاسم: " جميلة بدر السلماني",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع القمة الطبي مقابل الاطراف الصناعية خلف المستشفى العام ",
          الرقم: "07806052562",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "اية وليد و شهد حامد",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع المجد الطبي خلف المستشفى العام مقابل الاطراف الصناعية ",
          الرقم: "07800762993",
          الرقم_الثاني: "07813903810",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "فتاح فليح الشرقي",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "مجمع الراشد الطبي شارع الاستخبارات مجاور مجمع الحارث الطبي",
          الرقم: "07809923299",
          الرقم_الثاني: "07510705856",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "عبد المنعم بديوي الكبيسي ",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع:
            "مجمع الصدى الطبي قرب كلية الطب شارع باب الطوارئ للمستشفى العام ",
          الرقم: "07827797530",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: " أحمد شامي و محمد احمد فريح",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع: "",
          الرقم: "",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "العيادة التخصصية",
          التخصص: "طبيب/ جلدية وحساسية ",
          الموقع:
            "مجاور الاسعاف الفوري - مجمع ملائكة الرحمة الطبي - الطابق الثاني. ",
          الرقم: "07829912000",
          الرقم_الثاني: "07829913000",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "عماد عارف الكبيسي ",
          التخصص: "طبيب/ امراض نفسية وعصبية  ",
          الموقع: "مجمع البلسم مقابل باب الطوارئ القديم ",
          الرقم: "٠٧٨٠٩٣٦١٨٨٢",
          الرقم_الثاني: "",
          اوقات_الدوام: "سبت اثنين اربعاء "
        },
        {
          الاسم: "حسن خالد محمد ",
          التخصص: "طبيب/ امراض نفسية وعصبية  ",
          الموقع:
            "مجمع الصدى الطبي قرب مستشفى الفلوجة التعليمي مقابل كلية الطب ",
          الرقم: "07803979050",
          الرقم_الثاني: "",
          اوقات_الدوام: "سبت ثلاثاء خميس "
        },
        {
          الاسم: "عمار يوسف القدسي",
          التخصص: "طبيب/ امراض نفسية وعصبية  ",
          الموقع: "مجمع الرازي الطبي مقابل كلية الطب الفلوجة",
          الرقم: "07825364180",
          الرقم_الثاني: "",
          اوقات_الدوام: "الاثنين والثلاثاء والخميس "
        },
        {
          الاسم: "محمد عبد الله الحسن ",
          التخصص: "طبيب/ عيون  ",
          الموقع:
            "  العنوان الاول:مجمع الخضراء الطبي مقابل المحكمة القديمة , الثاني:بغداد نفق الشرطة عمارة خليل الكبيسي",
          الرقم: "07835556739",
          الرقم_الثاني: "07815843592",
          اوقات_الدوام: "في الفلوجة سبت اثنين اربعاء, في بغداد ثلاثاء خميس"
        },
        {
          الاسم: "عمر شعبان العاني",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع الكرادة الطبي مقابل باب الطوارىء للمستشفى العام ",
          الرقم: "07825436661",
          الرقم_الثاني: "",
          اوقات_الدوام: " الثلاثاء والخميس من كل اسبوع "
        },
        {
          الاسم: "علي عبد الجبار الجميلي",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع الروعة الطبي شارع المستشفى قرب الاطراف الصناعية",
          الرقم: "07819437383",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عبد الله ملحم",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ للمستشفى العام",
          الرقم: "07809553196",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " رافع علاوي الفياض",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع ملائكة الرحمة مجاور الاسعاف الفوري",
          الرقم: "07834988952",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " احمد مشعل الحديثي",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع الهلال الطبي مقابل باب طوارئ الجديد المستشفى",
          الرقم: "07827414416",
          الرقم_الثاني: "",
          اوقات_الدوام: " احد واربعاء عصرا"
        },
        {
          الاسم: "اسماعيل عبد الرزاق النعيمي",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع عين الحياة مقابل باب الطوارئ الجديد للمستشفى العام",
          الرقم: "07814487332",
          الرقم_الثاني: "",
          اوقات_الدوام: "يوم السبت والاحد من الساعة 11 صباحا الى 11ليلا"
        },
        {
          الاسم: " عمر حسين الراوي",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع الرازي مقابل كلية طب الفلوجة ",
          الرقم: "07822162259",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "صلاح عبد المجيد العبيدي",
          التخصص: "طبيب/ عيون  ",
          الموقع: "مجمع عافية الطبي مقابل الأطراف الصناعية",
          الرقم: "07827927291",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "ذاكر محمد محسن ",
          التخصص: "طبيب/ عيون  ",
          الموقع: "الرمادي شارع السينما مركز النهرين التخصصي للعيون",
          الرقم: "07830687000",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "أكثم بديع عبدالإله",
          التخصص: "طبيب/ عيون  ",
          الموقع:
            "شارع الاستخبارات - مجمع البستان الأخضرالطبي -مقابل البوابة الثالثة لمستشفى الفلوجة العام ",
          الرقم: "07830993520",
          الرقم_الثاني: "",
          اوقات_الدوام: "سبت واربعاء "
        },
        {
          الاسم: "عبد الوهاب الالوسي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع رفقة الطبي مجاور المستشفى العام ",
          الرقم: "07818446273",
          الرقم_الثاني: "",
          اوقات_الدوام: "ثلاثاء اربعاء وخميس"
        },
        {
          الاسم: "صباح منير العاني",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "خلف جامع الراوي مقابل مجمع العطور ",
          الرقم: "٠٧٨٠٧٠٠٢٨٤٦",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا يوم الجمعة عطلة "
        },
        {
          الاسم: "اياد حسين الندى",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع السلامة الطبي خلف جامع الحضرة",
          الرقم: "07809459626",
          الرقم_الثاني: "",
          اوقات_الدوام: "يبدأ  ١٠ صباحا"
        },
        {
          الاسم: ".محمود هادي الجنابي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع عافيه الطبي - خلف مستشفى الفلوجة التعليمي ",
          الرقم: "٠٧٨٢٧٩٦٥٧٧٢",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "علي عبد الرزاق الآلوسي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع السلام الطبي مقابل متوسطة الجمهورية التجريبية ",
          الرقم: "٠٧٨٠٧١٨٨٤٧٤",
          الرقم_الثاني: "",
          اوقات_الدوام: "وقت الحجز ١٠صباحا"
        },
        {
          الاسم: ".مازن جبار العلواني",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "",
          الرقم: "07832183020",
          الرقم_الثاني: "07802368609",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: " شامل خلف الحلبوسي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الرازي الطبي خلف المستشفى العام ",
          الرقم: "07827997732",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "جمال رسول الحمادي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الركن الطبي مجاور مستشفى الفلوجة التعليمي",
          الرقم: "07804194369",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "قصي الاعظمي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع:
            "مجمع الصدى الطبي قرب كلية الطب شارع باب الطوارئ للمستشفى العام ",
          الرقم: "٠٧٨٢٧٧٩٧٥٤٠",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "محمد جسام خلف",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع ملائكة الرحمة مجاور الاسعاف الفوري",
          الرقم: "07808637257",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "من الساعة الثالثة مساء الى التاسعة ليلا السبت والثلاثاء والخميس"
        },
        {
          الاسم: "علي النايل الجميلي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع:
            "مجمع ابن البيطار الطبي خلف المستشفى العام مقابل الاطراف الصناعية ",
          الرقم: "07800817724",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "احمد غانم العلي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الكندي مجاور المستشفى العام ",
          الرقم: "٠٧٨١٣٠٠٨٨٩٧",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " كمال اسماعيل",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع عافية الطبي مقابل الأطراف الصناعية خلف المستشفى ",
          الرقم: "07702935390",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "سعد جمعة عبد السلام",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الشفاء الطبي-مقابل مطعم حجي حسين-",
          الرقم: "07800074343",
          الرقم_الثاني: "",
          اوقات_الدوام: "الاربعاء صباحا ومساءآ"
        },
        {
          الاسم: " خلدون صابر خليفة",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الفاو الطبي قرب كلية طب الفلوجة",
          الرقم: "07807100083",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "علي عبيد محمود الزوبعي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع روعه الطبي شارع الاستخبارات ",
          الرقم: "٠٧٨٠٧٠٥٧٥٨١",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " ندى عبد الله الحسن",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع اسبرين مقابل باب الطوارىء ٣",
          الرقم: "07515724044",
          الرقم_الثاني: "",
          اوقات_الدوام: " احد اثنين و اربعاء"
        },
        {
          الاسم: " حميد الزكروط",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: " خلف جامع الراوي",
          الرقم: "07832963203",
          الرقم_الثاني: "",
          اوقات_الدوام: "وقت الحجز ٢ ظهرا"
        },
        {
          الاسم: "كمال رجا الحداد العيساوي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع مرحبا شارع الاستخبارات مجاور المستشفى العام",
          الرقم: "07810400699",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " قيس عبدالله الخضر",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "",
          الرقم: "07513054565",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عمار محمد جايد",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الفاو طابق ثاني خلف المستشفى العام ",
          الرقم: "٠٧٨٠٤٠٠٠٥٤٤",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة "
        },
        {
          الاسم: "اسامة اسماعيل",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع عافية خلف المستشفى مقابل الاطراف الصناعية ",
          الرقم: "07802840894",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "خيون سالم العلواني",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الخضراء مقابل المحكمة القديمة",
          الرقم: "07801675125",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "سامي المحمدي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الشفاء الطبي",
          الرقم: "07801528799",
          الرقم_الثاني: "",
          اوقات_الدوام: "الدوام صباحا ومساء عدا الجمعة عطلة"
        },
        {
          الاسم: " عبد الوهاب الفلوجي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع السلامة الطبي خلف جامع الحضرة",
          الرقم: "07827490819",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "فيصل العساف",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الهلال الطبي مقابل باب طوارئ المستشفى",
          الرقم: "07801069461",
          الرقم_الثاني: "",
          اوقات_الدوام: "الحجز قبل يوم من ١٠ صباحا إلى ٣ ظهرا"
        },
        {
          الاسم: "علي حياد المشهداني",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الكندي الطبي مجاور مستشفى الفلوجة التعليمي",
          الرقم: "07831568503",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "صالح كمال صالح العاني",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع عين الحياة مقابل باب الطوارئ للمستشفى العام ",
          الرقم: "07817298895",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "لؤي احمد العاني",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الحارثية الطبي خلف المستشفى العام",
          الرقم: "٠٧٨٢٦٢٥٦٠١٨",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "محمد اسماعيل داود",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع ملائكة الرحمة مجاور الاسعاف الفوري ",
          الرقم: "٠٧٨٣٢٥٧٤٩٧٩",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "كل الايام وقت للحجز ١١ صباحا عد السبت والثلاثاء والجمعة عطلة"
        },
        {
          الاسم: " عبد الرحمن الفياض",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "شارع العيادة الشعبية مقابل الاسعاف الفوري",
          الرقم: "07809387818",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "ضياء محمود الجميلي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع دار الشفاء مجاور الاطراف الصناعية ",
          الرقم: "٠٧٨٠٨٦٥٢٤٠٨",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "عمر ربيع الدهان",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع البلسم مقابل باب الطوارئ الثالث شارع الاستخبارات ",
          الرقم: "07808866415",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " احمد عبد الجبار",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع ابن البيطار الطبي خلف المستشفى العام ",
          الرقم: "٠٧٨١٩٦٧٥٢٧٣",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "وقت الحجز ١٠ صباحا ٢٥ اسم على التلفون وحجز بالعيادة ساعة 2.30 ظهرا"
        },
        {
          الاسم: " عبد الحميد الدليمي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الشفاء الطبي مقابل حلويات البستاني",
          الرقم: "07808910300",
          الرقم_الثاني: "",
          اوقات_الدوام: "الدوام صباحا ومساء عدا يوم الاثنين"
        },
        {
          الاسم: "هند حسن الحديثي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الحارثية الطبي شارع الاستخبارات خلف المستشفى ",
          الرقم: "٠٧٨١٢١٧٦٧٠٦",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "وليد خالد الفهداوي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "الشهداء قرب مدرسة الراوبط",
          الرقم: "٠٧٨٠٠٦٤١٤٠٥",
          الرقم_الثاني: "",
          اوقات_الدوام: "سبعة ايام في الاسبوع"
        },
        {
          الاسم: "مهند العبيدي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الكرادة الطبي مقابل باب طؤارئ رقم ٢ المستشفى العام ",
          الرقم: "٠٧٨١٣٩١٧٧١٧",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "بشير الحاج فرحان ",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الفاو الطبي خلف المستشفى العام ",
          الرقم: "07813234563",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " ناجي الفلاحي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع سوبر فارما الطبي مقابل كلية طب الفلوجة ",
          الرقم: "07822854782",
          الرقم_الثاني: "",
          اوقات_الدوام: " الاثنين ٨ إلى 1 ظه"
        },
        {
          الاسم: " عبد الحميد المعاضيدي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "شارع العام مجاور مأكولات الشيف يوسف مقابل الصناعة",
          الرقم: "07830779615",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام ١٠ __ ٣ مساء عدا الجمعة عطلة"
        },
        {
          الاسم: "طه محمد فتيح",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ الخلفي للمستشفى العام ",
          الرقم: "07829079343",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام"
        },
        {
          الاسم: " احمد محمد فياض الجميلي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع لبنى حي الشهداء مقابل مركز صحي الشهداء ",
          الرقم: "",
          الرقم_الثاني: "",
          اوقات_الدوام: "الحجز مباشر داخل العيادة"
        },
        {
          الاسم: "عمر علي الجنابي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع:
            "مجمع الياقوته الطبي...شارع الثرثار مجاور جامع الحضرة المحمديه",
          الرقم: "٠٧٨١٠٤٠٠٦٩٩",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "ثائر بشير الجبوري ",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع:
            "مجمع القمة الطبي- مقابل الاطراف الصناعية لمستشفى الفلوجة التعليمي ",
          الرقم: "07500953539",
          الرقم_الثاني: "",
          اوقات_الدوام: "كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "عبد الرحمن العيساوي ",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "حي المعلمين شارع الكبيسات مجمع الاقصى الطبي",
          الرقم: "07809894474",
          الرقم_الثاني: "",
          اوقات_الدوام: "من ساعه الثالثه ونص عصراالى الساعة الثامنة مساءً"
        },
        {
          الاسم: "غادة وائل تحسين العاني",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع ابن النفيس الطبي مقابل الأطراف الصناعية ",
          الرقم: "07803399243",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: "رشيد جاسب صالح",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع: "مجمع الرحمن الطبي في شارع العياده الشعبيه مقابل الأسعاف ",
          الرقم: "07818998574",
          الرقم_الثاني: "07509809525",
          اوقات_الدوام: ""
        },
        {
          الاسم: " ايناس شاكر محمود المحمدي",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع:
            "شارع الاستخبارات-مجمع الفلوجة الطبي-خلف مستشفى الفلوجه التعليمي-قرب مرطبات فستقه ",
          الرقم: "07500441429",
          الرقم_الثاني: "",
          اوقات_الدوام: "من الاحد الى الخميس "
        },
        {
          الاسم: "حمزة عذاب",
          التخصص: "طبيب/ باطنية وقلبية وصدرية  ",
          الموقع:
            "مجمع المجد الطبي-مقابل باب الاطراف الاصطناعيةلمستشفى الفلوجة العام",
          الرقم: "07510704015",
          الرقم_الثاني: "",
          اوقات_الدوام: "يداوم يوم الثلاثاء مساء فقط"
        },
        {
          الاسم: "عبير وائل تحسين العاني ",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الفاو الطبي خلف المستشفى العام ",
          الرقم: "07832155050",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " هشام محمود الجنابي",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع اسبرين الطبي مقابل باب الطوارىء ٣",
          الرقم: "07806743060",
          الرقم_الثاني: "07500998948",
          اوقات_الدوام: "وقت الحجز من ١٠ صباحا , الجمعة عطلة"
        },
        {
          الاسم: " هيثم الجدة",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع السلام الطبي مقابل المحكمة القديمة",
          الرقم: "07800800088",
          الرقم_الثاني: "",
          اوقات_الدوام: " يومي الخميس والسبت"
        },
        {
          الاسم: "حسن عبدالفتاح عبدالوهاب ",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع الصدى الطبي قرب مستشفى الفلوجة مقابل كلية الطب",
          الرقم: "07840857201",
          الرقم_الثاني: "",
          اوقات_الدوام: ""
        },
        {
          الاسم: " رعد جميل ",
          التخصص: "طبيب/ مفاصل وكسور  ",
          الموقع: "مجمع رفقة - شارع الاستخبارات - ركن مستشفى الفلوجة التعليمي ",
          الرقم: "07854623432",
          الرقم_الثاني: "",
          اوقات_الدوام:
            "السبت والاحد من ١١ صباحاً الى ١٠ مساءا, باقي ايام الاسبوع من ١٠ صباحاً الى الرابعة عصراً"
        },
        {
          الاسم: "  باسم عطا الله العبدلي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: "مجمع النور شارع الاستخبارات خلف المستشفى العام  ",
          الرقم: "07805033298 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام التاسعة صباحا, عدا الخميس والجمعة عطلة"
        },
        {
          الاسم: "رعد فرحان الفلاحي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع السلامة الطبي نزلت جسر الحضرة الاسبوع شارع ٤٠",
          الرقم: " 07906798793",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "حارث محي العبدلي  ",
          التخصص: "طبيب/ اطفال  ",
          الموقع:
            "مجمع الحارث الطبي شارع الاستخبارات مقابل مكوى الرداء الابيض صيدلية العادل ",
          الرقم: "07808362686 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "يبدا الحجز ١٠ صباحا "
        },
        {
          الاسم: "شار طالب هويدي العاني ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع الفا الطبي خلف المستشفى العام ",
          الرقم: " 07813030807",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام عدا الجمعة عطلة"
        },
        {
          الاسم: "سعد توفيق نجم الحديثي  ",
          التخصص: "طبيب/ اطفال  ",
          الموقع:
            " مجمع الفلوجة الطبي-شارع الاستخبارات-خلف مستشفى الفلوجة-قرب مرطبات فستقة",
          الرقم: " 07834926818",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  فراس صادق الكبيسي",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع الكرادة الطبي مقابل باب الطوارىء المستشفى العام ",
          الرقم: "07818442848 ",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            " احد واربعاء دوام, الحجز طيلة ايام الاسبوع من ٢ الى ٩ مساء"
        },
        {
          الاسم: "احمد سالم الجنابي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " شارع اربعين حي الشرطة مجمع صيدلية التهاني",
          الرقم: " 07828240582",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " علاوي العيساوي",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع سوبر فارما الطبي بجانب المستشفى",
          الرقم: "07830026326 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  ابراهيم حامد فتحي",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " خلف جامع الراوي",
          الرقم: " ٠٧٨١٩٤١٠٩٩٢",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: ". أحمد ابراهيم الجميلي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: "مجمع الروعة خلف المستشفى العام  ",
          الرقم: "٠٧٨١٨٤٨٠٠١١ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " جمال نوري الالوسي",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع عين الحياة خلف المستشفى",
          الرقم: " 07812800847",
          الرقم_الثاني: "٠٧٨٣٠٨١٠١٣٣ ",
          اوقات_الدوام:
            "صباحا في مجمع الشفاء الطبي على الرقم الثاني, وعين الحياة على الرقم الاول "
        },
        {
          الاسم: "  نور حامد المحمدي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: "الفلوجة شارع الاستخبارات مجمع زينة الحياة الطبي  ",
          الرقم: " ٠٧٥٠٢٦٣٦٨٢٥",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " مجيد حميد العجيلي",
          التخصص: "طبيب/ اطفال  ",
          الموقع: "مجمع الفارابي مقابل باب الطوارئ الجديد للمستشفى العام  ",
          الرقم: "07817824585 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " احمد عريبي سلمان",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع الخضراء مقابل المحكمة القديمة",
          الرقم: " 07802396966",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "سميرة العاني ",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مجمع الفاو الطبي خلف المستشفى العام",
          الرقم: " 07814394832",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام العاشرة صباحا, عدا الثلاثاء والجمعة عطلة"
        },
        {
          الاسم: " علي جاسم ابراهيم",
          التخصص: "طبيب/ اطفال  ",
          الموقع: " مقابل باب الاطراف الاصطناعية لمستشفى الفلوجة التعليمي .",
          الرقم: "07837398081 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "زيد عواد الدليمي ",
          التخصص: "طبيب/ اطفال  ",
          الموقع:
            " مجمع البلسم الطبي مقابل باب الطوارىء الخلفي المستشفى العام ",
          الرقم: "07829236140 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام عدا الجمعه عطلة"
        },
        {
          الاسم: "سعد الجبوري",
          التخصص: "طبيب/ اطفال  ",
          الموقع:
            "مجمع ابن الهيثم شارع اربعين حي الشرطة مقابل كافتريا الاكارم ",
          الرقم: "07800855287 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "منتهى الهدهود ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " شارع المنجزات قرب جسر العيادة ",
          الرقم: " 07819492356",
          الرقم_الثاني: " ",
          اوقات_الدوام: " وقت الحجز من ١٠ إلى اكتمال العدد المقرر, الجمعة عطلة"
        },
        {
          الاسم: " ايمان الحديثي  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع الفلوجة الطبي خلف المستشفى العام قرب مرطبات فستقة  ",
          الرقم: "07822645640 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  لقاء انور القصير",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع الكندي مجاور المستشفى الفلوجة التعليمي",
          الرقم: " 07821090425",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            " الثلاثاء والاربعاء والخميس من الساعة 3 عصرا الى الساعة 7 مساء"
        },
        {
          الاسم: " لقاء انور القصير",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " وفي مجمع العامرية خلف جامع الرحمن ",
          الرقم: "07813580326 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " سبت احد اثنين"
        },
        {
          الاسم: " كوثر يحيى العبيدي ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع الحارث شارع الاستخبارات صيدلية العادل",
          الرقم: " ٠٧٨٠٨٣٦٢٦٨٦",
          الرقم_الثاني: " ",
          اوقات_الدوام: " وقت الحجز ١٠ صباحا"
        },
        {
          الاسم: " رغد احمد عباس",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع عافية مقابل الأطراف الصناعية خلف المستشفى ",
          الرقم: "٠٧٨٢٣٤١٠٢٠٥ ",
          الرقم_الثاني: "٠٧٥١٩٤٢٤٥٥٦ ",
          اوقات_الدوام: "السبت - الاثنين - اربعاء - خميس  "
        },
        {
          الاسم: "شيماء محمد مطر ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع:
            "مجمع زينه الحياة الطبي في بداية شارع الاستخبارات من جهة شارع الأربعين يمينا ",
          الرقم: " ٠٧٨١١٥٦٤٨٠٩",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام عدا الجمعة الجمعة عطلة "
        },
        {
          الاسم: "  نادية حسن حسين",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع الحياة شارع اربعين حي الشرطة مقابل كافتريا الاكارم  ",
          الرقم: "07800054353 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل الايام عدا الاربعاء والجمعة عطلة"
        },
        {
          الاسم: "محاسن كمال صالح ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع الابرار خلف المستشفى العام  ",
          الرقم: "07832805285 ",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            " الحجز الساعة 9صباحا الدوام يوميا عصرا عدا الخميس صباحا فقط الجمعة والثلاثاء عطلة, دوام العيادة ٢.٣٠ ظهرا"
        },
        {
          الاسم: " ابتسام صالح المعاضيدي",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع بلقيس مقابل العيادة الشعبية ",
          الرقم: "٠٧٨٠٣٥٧٦٠٨١ ",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            " يوم السبت والاحد والاثنين, الحجز قبل يوم يبدأ الحجز ٩ صباحا"
        },
        {
          الاسم: "  امل الحمداني ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "الفرع المقابل لبريد الفلوجة  ",
          الرقم: " 07901599781",
          الرقم_الثاني: " 07831241306",
          اوقات_الدوام:
            " الرقم الاول اثنين وجمعة ام ضحى ارسال رسالة بالاسم, الرقم الثاني سبت واربعاء ام ايمن اتصال"
        },
        {
          الاسم: " فداء نجم الشاها",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع:
            "مجمع الامانة الطبي شارع الاستخبارات قرب مستشفى الفلوجه العام  ",
          الرقم: " 07817429545",
          الرقم_الثاني: " ",
          اوقات_الدوام: " الخميس والجمعة عطلة يبدأ الحجز ١١ صباحا"
        },
        {
          الاسم: "كروان خالد كاظم ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع ابن البيطار الطبي مقابل الاطراف الصناعية",
          الرقم: " 07802368609",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " خالدة الحمداني",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "شارع حي الشرطة مقابل الاكارم ",
          الرقم: " 07800855287",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            " سبت احد اربعاء مساء,الثلاثاء صباحا ومساء من الساعة الواحدة الى الساعة الرابعة عصرا,الحجز داخل العيادة فقط والحضور من ١٢ الى ٤ عصرا "
        },
        {
          الاسم: "سوزان الحديثي  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع السلام مقابل متوسطة الجمهورية التجريبية  ",
          الرقم: " 07819027347",
          الرقم_الثاني:
            "الدوام السبت الاثنين والخميس من الساعة الثانية عشر ظهر ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " بشرى فرحان المحمدي ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع السلامة الطبي شارع اربعين حي الشرطة نزلت الجسر",
          الرقم: " 07819604557",
          الرقم_الثاني: " ",
          اوقات_الدوام: "الحجز من ٩ الى ١١ ظهرا "
        },
        {
          الاسم: "  بشرى الجبوري ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع:
            " مجمع رويال الطبي قرب باب الطوارئ القديم لمستشفى الفلوجة التعليمي ",
          الرقم: " 07816822613",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            "الجمعة والسبت والثلاثاء عطلة ,وقت الحجز من ٣ ونصف الى ٨ مساء "
        },
        {
          الاسم: " عواطف النايل ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع ملائكة الرحمة مجاور الاسعاف الفوري  ",
          الرقم: " 07802381010",
          الرقم_الثاني: "٠٧٨١١٥٥٥٣٣٤ ",
          اوقات_الدوام: " وقت الحجز 8 صباحا الى 8 مساء الجمعة والاحد عطلة"
        },
        {
          الاسم: " فائزة كمال العاني ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع عين الحياة مقابل باب الطوارئ الجديد المستشفى العام",
          الرقم: " 07808857816",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            "الجمعة عطلة ,وقت الحجز من ٩ إلى ١٠ صباحا ,دوام الدكتورة ٣ ونصف مساء "
        },
        {
          الاسم: " ثناء محمد فتيح العاني ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع الرازي مقابل كلية طب الفلوجة  ",
          الرقم: " 07831954549",
          الرقم_الثاني: " ",
          اوقات_الدوام:
            "عطلة العيادة الاثنين والجمعة ,دوام الطبيبة من ٤_٧ مساءا ,يبدا الحجز 10 صباحا "
        },
        {
          الاسم: " سولاف لطوف الراوي",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع بيت الدواء الطبي مقابل متوسطة ابن خلدون للبنين خلف المستشفى العام  ",
          الرقم: " 07832955377",
          الرقم_الثاني: " ",
          اوقات_الدوام: "وقت الحجز مفتوح "
        },
        {
          الاسم: " رشا شاكر محمود",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع الفا الطبي قرب كلية طب الفلوجة ",
          الرقم: " 07802770890",
          الرقم_الثاني: " ",
          اوقات_الدوام: "الجمعة عطلة يبدا الحجز ١١ صباحا  "

        },
        {
          الاسم: "مريم سودان ابراهيم ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع مرحبا الطبي _شارع الاستخبارات مجاور مستشفى الفلوجة التعليمي",
          الرقم: " 07752304489",
          الرقم_الثاني: "07509828575 ",
          اوقات_الدوام: " وقت الحجز مفتوح"
        },
        {
          الاسم: "هدى حامد الجنابي ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع البلسم الطبي مقابل باب الطوارئ الجديد للمستشفى العام ",
          الرقم: "07825499828 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " وقت الحجز من ٩ صباحا, عطلة العيادة الجمعة السبت"
        },
        {
          الاسم: " ايمان عبد الحميد المعاضيدي  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " شارع الاسعاف الفوري مجاور الصيدلية الذهبية",
          الرقم: " ٠٧٨١٢٠٩٦٣٠٤",
          الرقم_الثاني: " ",
          اوقات_الدوام: " كل ايام الاسبوع عدا الجمعة والثلاثاء, الحجز يومي صباحا "
        },
        {
          الاسم: "رغد سعود الكبيسي  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "حي نزال مقابل جامع المكرمين ",
          الرقم: " ٠٧٨١٨٧٧٢٠٠٦",
          الرقم_الثاني: " ",
          اوقات_الدوام: " وقت الحجز من ٩ صباحا الى ٢ مساء, الجمعة عطلة "

        },
        {
          الاسم: " امل عبد الحميد المعاضيدي ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " بمجمع التهاني الطبي مقابل متنزه حي الشرطة ",
          الرقم: " ٠٧٨٢٨٢٤٠٥٨٢",
          الرقم_الثاني: " ",
          اوقات_الدوام: "الاحد والثلاثاء فقط "
        },
        {
          الاسم: "ميساء عبدالله الكبيسي ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع الكرادة الطبي مقابل باب الطؤارئ المستشفى العام ",
          الرقم: " 07810447554",
          الرقم_الثاني: " ",
          اوقات_الدوام: "الاثنين والجمعة عطلة  "
        },
        {
          الاسم: "رغد باسم عبد الرزاق  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع سوبر فارما مقابل كلية طب الفلوجة ",
          الرقم: " 07829805691",
          الرقم_الثاني: " ",
          اوقات_الدوام: " الجمعة عطلة "
        },
        {
          الاسم: " .بيداء عبدالله الحسن",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع الركن الطبي مجاور مستشفى الفلوجة التعليمي",
          الرقم: " 07806541793",
          الرقم_الثاني: " ",
          اوقات_الدوام: "احد _الثلاثاء _الخميس "
        },
        {
          الاسم: " حمدية طلب كوكز",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع المجد الطبي - مقابل باب الاطراف الصناعية لمستشفى الفلوجة العام. مجاور مختبر بيروت الطبي",
          الرقم: " ٠٧٨٣٧٣٩٨٠٨١",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " منيرة عراك الجميلي",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " حي الضباط/شارع الاستخبارات قرب دائرة الاستخبارات سابقا مجمع الامل الطبي ",
          الرقم: " 07808698562",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "هالة هاشم العاني ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع الصدى الطبي شارع باب الطوارئ مستشفى الفلوجة التعليمي مقابل كلية الطب ",
          الرقم: "07848390074 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " يتوفر حجز داخل العيادة"
        },
        {
          الاسم: " بان المحمداوي  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " مجمع زيونه الطبي /مقابل البوابه الثالثه لمستشفى الفلوجه التعليمي",
          الرقم: "07836444884 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "انفال زياد خلف  ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع المجد الطبي مقابل باب الاطراف الاصطناعيةلمستشفى الفلوجة العام ",
          الرقم: "07854619505 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "لميس اسعد شكري النائب ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: "مجمع ادم الطبي مقابل باب المستشفى رقم ٣ ",
          الرقم: "0785207920 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " ",
          التخصص: "طبيبة/ نسائية وتوليد  ",
          الموقع: " ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        
      ]
    };
  },
  components: { LoadingDialog },
  computed: {
    numberOfPages() {
      return Math.ceil(this.items.length / this.itemsPerPage);
    },
    filteredKeys() {
      return this.keys.filter(key => key !== "name");
    }
  },
  methods: {
    nextPage() {
      if (this.page + 1 <= this.numberOfPages) this.page += 1;
    },
    formerPage() {
      if (this.page - 1 >= 1) this.page -= 1;
    },
    updateItemsPerPage(number) {
      this.itemsPerPage = number;
    },
    copy(copyItem) {
      try {
        this.copyText = copyItem;
        if (this.copyText == ".." || this.copyText == "") {
          this.snackbar = true;
          this.snackBarText = "لا يوجد رقم";
          this.snackBarColor = "error";
        } else {
          navigator.clipboard.writeText(this.copyText);
          this.snackbar = true;
          this.snackBarText = "تم نسخ الرقم";
          this.snackBarColor = "success";
        }
      } catch (e) {
        console.log(e);
      }
    }
  }
};
</script>

<style lang="scss">
</style>