<template>
  <v-container fluid class="search-by">

    <loadingDialog :visible="loadingDialog" />
    <v-snackbar
      app
      left
      transition="scroll-y-reverse-transition"
      v-model="snackbar"
      timeout="5000"
      :color="snackBarColor"
    >
      <p class="white--text ma-0">{{ snackBarText }}</p>
      <template v-slot:action="{ attrs }">
        <v-btn color="white" text v-bind="attrs" @click="snackbar = false">اغلاق</v-btn>
      </template>
    </v-snackbar>
    <v-data-iterator
      :items="items"
      :items-per-page.sync="itemsPerPage"
      :page.sync="page"
      :search="search"
      :sort-by="sortBy.toLowerCase()"
      :sort-desc="sortDesc"
      hide-default-footer
    >
      <template v-slot:header>
        <v-toolbar dark color="success darken-2 " class="mb-1">
          <v-text-field
            v-model="search"
            clearable
            flat
            solo-inverted
            hide-details
            prepend-inner-icon="mdi-magnify"
            label="بحث"
          ></v-text-field>
          <template v-if="$vuetify.breakpoint.mdAndUp">
            <v-spacer></v-spacer>
            <v-select
              v-model="sortBy"
              flat
              solo-inverted
              hide-details
              :items="keys"
              prepend-inner-icon="mdi-magnify"
              label="الترتيب حسب"
              class="blue--text"
            ></v-select>
            <v-spacer></v-spacer>
            <v-btn-toggle v-model="sortDesc" mandatory>
              <v-btn large depressed color="success darken-1" :value="false">
                <v-icon>mdi-arrow-up</v-icon>
              </v-btn>
              <v-btn large depressed color="success darken-1" :value="true">
                <v-icon>mdi-arrow-down</v-icon>
              </v-btn>
            </v-btn-toggle>
          </template>
        </v-toolbar>
      </template>

      <template v-slot:default="props">
        <v-row>
          <v-col v-for="item in props.items" :key="item.الاسم" cols="12" sm="6" md="4" lg="3">
            <v-card>
              <v-card class="d-flex">
                <v-card-title class="subheading font-weight-bold">{{ item.الاسم }}</v-card-title>
              </v-card>

              <v-divider></v-divider>

              <v-list dense>
                <v-list-item v-for="(key, index) in filteredKeys" :key="index">
                  <v-list-item-content :class="{ 'blue--text': sortBy === key }">{{ key }}:</v-list-item-content>
                  <v-list-item-content
                    class="align-end"
                    :class="{ 'blue--text': sortBy === key }"
                  >{{ item[key.toLowerCase()] }}
                  <v-btn
                      @click="copy(item.الرقم_الثاني)"
                      v-if=" (key == 'الرقم_الثاني') && (item.الرقم_الثاني != '') && (item.الرقم_الثاني != ' ')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                  <v-btn
                      @click="copy(item.الرقم)"
                      v-if=" (key == 'الرقم') && (item.الرقم != ' ') && (item.الرقم != '')"
                      style="flex: 0; margin-right: 5px; color: red; top: 6px;"
                    >نسخ</v-btn>
                    
                  </v-list-item-content>
                </v-list-item>
              </v-list>
            </v-card>
          </v-col>
        </v-row>
      </template>

      <template v-slot:footer>
        <v-row class="mt-2" align="center" justify="center">
          <span style="color:#1B5E20;">الاطباء لكل صفحة</span>
          <v-menu offset-y>
            <template v-slot:activator="{ on, attrs }">
              <v-btn dark text color="primary" class="ml-2" v-bind="attrs" v-on="on">
                {{ itemsPerPage }}
                <v-icon>mdi-chevron-down</v-icon>
              </v-btn>
            </template>
            <v-list>
              <v-list-item
                v-for="(number, index) in itemsPerPageArray"
                :key="index"
                @click="updateItemsPerPage(number)"
              >
                <v-list-item-title>{{ number }}</v-list-item-title>
              </v-list-item>
            </v-list>
          </v-menu>

          <v-spacer></v-spacer>

          <span class="mr-4" style="color: #1B5E20;">صفحة {{ page }} من {{ numberOfPages }}</span>
          <v-btn fab dark color="success darken-2" class="mr-1" @click="formerPage">
            <v-icon>mdi-chevron-left</v-icon>
          </v-btn>
          <v-btn fab dark color="success darken-2" class="ml-1" @click="nextPage">
            <v-icon>mdi-chevron-right</v-icon>
          </v-btn>
        </v-row>
      </template>
    </v-data-iterator>
  </v-container>
</template>

  <script>
import LoadingDialog from "./LoadingDialog.vue";
export default {
  data() {
    return {
      copyText: "",
      snackbar: false,
      snackBarText: "",
      snackBarColor: "",
      loadingDialog: false,
      overlay: false,
      itemsPerPageArray: [4, 8, 12],
      search: "",
      filter: {},
      sortDesc: false,
      page: 1,
      itemsPerPage: 4,
      sortBy: "Name",
      keys: [
        "الاسم",
        "التخصص",
        "الرقم",
        "الرقم_الثاني",
        "الموقع",
        "اوقات_الدوام"
      ],
      items: [
        {
          الاسم: "صيدلية رفقة ",
          التخصص: "صيدلية/  ",
          الموقع: " مجاور المستشفى العام مجاور مدرسة النخيل ",
          الرقم: " 07843728077",
          الرقم_الثاني: " ",
          اوقات_الدوام: " ٢٤ ساعة ٧ ايام في الاسبوع"
        },
        {
          الاسم: "الصيدلية المركزية ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع الثرثار قرب حلويات البستاني ",
          الرقم: "07805736291 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الحسنى  ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع الاسعاف الفوري مقابل مدرسة الجمهورية ",
          الرقم: " 07810401920",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٨ صباحا الى ١٢ ليلا "
        },
        {
          الاسم: "صيدلية فيتامين ",
          التخصص: "صيدلية/  ",
          الموقع: "شارع الاسعاف الفوري مجاور حلويات ثائر الراوي  ",
          الرقم: "07825067085 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية منقذة السعودي ",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل جامع الفرقان تقاطع الكماليات ",
          الرقم: " 07817635498",
          الرقم_الثاني: " ",
          اوقات_الدوام: " من ١٢ ظهرا الى ١٢ ليلا"
        },
        {
          الاسم: " صيدلية دواكم",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل بريد الفلوجة ",
          الرقم: "07710343343 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية محمد عبيد",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع الحارثية شارع الاستخبارات خلف المستشفى العام مقابل الاطراف الصناعية ",
          الرقم: " 07801146692",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية سارة قاسم  ",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع ابن النفيس شارع الاستخبارات خلف المستشفى العام ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية امنية ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الرازي الطبي مقابل كلية طب الفلوجة  ",
          الرقم: " 07733743699",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية دار الحكمة",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الفاو الطبي خلف المستشفى العام  ",
          الرقم: "07834976356 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٣ الى ١٠ ليلا "
        },
        {
          الاسم: " صيدلية الاماني",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الفاو الطبي خلف المستشفى العام  ",
          الرقم: "07832494033 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية دارين  ",
          التخصص: "صيدلية/  ",
          الموقع: " ش٤٠ مقابل ستوديو هبة ",
          الرقم: " 07817423486",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية لارين",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع سوبر فارما مقابل كلية طب الفلوجة  ",
          الرقم: "07904980683 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية عفاف ",
          التخصص: "صيدلية/  ",
          الموقع: " ساحة ميسلون ركن السينما القديمة ",
          الرقم: " 07807133381",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية الطوارئ",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل باب الطوارئ القديم للمستشفى العام ",
          الرقم: "07819897000 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الرافدين ",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل بريد الفلوجة ",
          الرقم: " 07903269797",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية بغداد",
          التخصص: "صيدلية/  ",
          الموقع: "مقابل بريد الفلوجة   ",
          الرقم: "07822790766 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية ياسين محمد حسين ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع الاسعاف الفوري مجمع د. صباح منير العاني ",
          الرقم: "07808844664 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الرشيد ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع الاسعاف الفوري  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الشفاء ",
          التخصص: "صيدلية/  ",
          الموقع: "  شارع الاسعاف الفوري ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية احمد علي الخالدي ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الزيدي مجاور كافتريا قيس قرب جسر العيادة  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الوصفة الذهبية",
          التخصص: "صيدلية/  ",
          الموقع: " شارع الاسعاف الفوري  ",
          الرقم: " 07822979363",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية بيت الدواء",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الشمس مقابل متوسطة الجمهورية  ",
          الرقم: "07827688872 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية زياد العبيدي  ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الخضراء الطبي مقابل المحكمة القديمة  ",
          الرقم: "07734487394 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الريان ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الشفاء الطبي  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية تاج الصحة",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الشفاء الطبي  ",
          الرقم: "07723377941 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية الاخلاص ",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل مجمع الشفاء الطبي ",
          الرقم: "07801153522 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الصفوة",
          التخصص: "صيدلية/  ",
          الموقع: "  شارع اربعين نزلت جسر الحضرة مجمع السلامة الطبي ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية العرين  ",
          التخصص: "صيدلية/  ",
          الموقع: "مجمع العرين شارع اربعين مقابل متنزه حي الشرطة  ",
          الرقم: " 07827680005",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية تهاني ",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع تهاني شارع حي الشرطة مقابل المتنزه ",
          الرقم: "07827191630 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية الرحاب ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع اربعين مقابل كافتريا الاكارم  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية امنة ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الحياة مقابل كافتريا الاكارم  ",
          الرقم: "07810876616 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية المتحدة",
          التخصص: "صيدلية/  ",
          الموقع: "  شارع اربعين مقابل مجمع المختار التجاري",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية حي الشرطة  ",
          التخصص: "صيدلية/  ",
          الموقع: "تقاطع حي الشرطة _ شارع الجيش الشعبي  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  صيدلية ليان",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع البلسم الطبي مقابل باب الطوارئ الجديد للمستشفى  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية مينا",
          التخصص: "صيدلية/  ",
          الموقع: "  مقابل باب الطوارئ الجديد للمستشفى العام ",
          الرقم: "07816813633 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " من ٣ مساء الى ١٢ ليلا"
        },
        {
          الاسم: "صيدليه رنا صباح العبيدي  ",
          التخصص: "صيدلية/  ",
          الموقع: "مجمع اليمامه خلف متوسطة ابن خلدون   ",
          الرقم: " 07801767766",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية الكرامة",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الهلال الطبي مقابل باب الطوارئ الجديد للمستشفى العام  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٣ الى ١٠ مساء "
        },
        {
          الاسم: " صيدلية لؤلؤة الشهباء",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع دار الشفاء مجاور الاطراف الصناعية ",
          الرقم: " 07801146692",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٣ الى ١٠ مساء "
        },
        {
          الاسم: "صيدلية التسنيم ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع المنصور الطبي شارع الاستخبارات خلف المستشفى العام ",
          الرقم: " 07800179710",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية هند احمد شريف",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الروعة الطبي شارع الاستخبارات خلف المستشفى العام  ",
          الرقم: " 07734493650",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٣ الى ١١ مساء "
        },
        {
          الاسم: "صيدلية النرجس ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الامانة الطبي شارع الاستخبارات خلف المستشفى العام  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "من ٣ الى ١٠ مساء "
        },
        {
          الاسم: " صيدلية الياقوتة",
          التخصص: "صيدلية/  ",
          الموقع: "مجمع الياقوتة الطبي شارع الثرثار مجاور جامع الحضرة المحمدية   ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية وسن سعدون العبدلي ",
          التخصص: "صيدلية/  ",
          الموقع: " مقابل متوسطة ابن خلدون ",
          الرقم: " 07901475576",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  صيدلية تمارة",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع الفا مقابل متوسطة ابن خلدون",
          الرقم: " 07806641738",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "  صيدلية شهلاء العاني ",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع الابرار مقابل متوسطة ابن خلدون ",
          الرقم: "صيدلية الانوار المحمدية ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية الانوار المحمدية",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع الانوار المحمدية مقابل كلية طب الفلوجة ",
          الرقم: " 07818304523",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية لقاء",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الفارابي مقابل كلية طب الفلوجة  ",
          الرقم: " 07811171267",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "الصيدلية الملكية",
          التخصص: "صيدلية/  ",
          الموقع: "مجمع رويال الطبي مقابل كلية طب الفلوجة   ",
          الرقم: "من ٢ الى ١١ ليلا ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية عين الحياة ",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع عين الحياة مقابل باب الطوارئ القديم للمستشفى العام ",
          الرقم: " 07814263739",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية هدى جاسم نوري ",
          التخصص: "صيدلية/  ",
          الموقع: "  مجمع الوليد مقابل باب الطوارئ القديم للمستشفى العام ",
          الرقم: "07814459634 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية القند",
          التخصص: "صيدلية/  ",
          الموقع: " مجمع الكندي الطبي مجاور مستشفى الفلوجة العام  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية العنان ",
          التخصص: "صيدلية/  ",
          الموقع: " تقاطع شارع الفرقان شارع اربعين ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدلية غصن البان ",
          التخصص: "صيدلية/  ",
          الموقع: "  حي_الجغيفي_بداية_شارع_الشركة",
          الرقم: " ٠٧٨١٥٩٧٢٦٥٤",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية بان خميس محمد ",
          التخصص: "صيدلية/  ",
          الموقع: " شارع 40 مقابل متنزه حي الشرطة ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية الاء مؤيد عبدالله ",
          التخصص: "صيدلية/  ",
          الموقع: "حي العسكري مجمع الحسن الطبي مقابل مركز صحي السمنت  ",
          الرقم: " ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية السرور",
          التخصص: "صيدلية/  ",
          الموقع: " حي الجمهورية تقاطع العيادة الشعبية مقابل متوسطة الجمهورية ",
          الرقم: "٠٧٧٤٠٣٥٩٣٦٥ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: "صيدليه الاء مويد عبدالله  ",
          التخصص: "صيدلية/  ",
          الموقع: " حي المعلمين شارع الكبيسات  ",
          الرقم: " 07711180329",
          الرقم_الثاني: " ",
          اوقات_الدوام: "صباحا *** ومساء "
        },
        {
          الاسم: "صيدلية زيد احمد حماد ",
          التخصص: "صيدلية/  ",
          الموقع: "جبيل قرب مركز صحي جبيل  ",
          الرقم: "٠٧٨٠٦٨٢٦٦١٣ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: "تفتح الصيدلية صباحاً ومساء "
        },
        {
          الاسم: "صيدليه نور الهدى ",
          التخصص: "صيدلية/  ",
          الموقع: " حي المعلمين شارع الكبيسات مجاور مجمع الاقصى  ",
          الرقم: " ٠٧٧١١١٨٠٣٢٩",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية القمة ",
          التخصص: "صيدلية/  ",
          الموقع: "خلف المستشفى العام مقابل الاطراف الصناعية   ",
          الرقم: "٠٧٨١١٨٨٤٤٩٣ ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        {
          الاسم: " صيدلية النخبة ",
          التخصص: "صيدلية/  ",
          الموقع: "  شارع الثرثار - مقابل مرطبات فيروزة ",
          الرقم: "07818999099 ",
          الرقم_الثاني: " ",
          اوقات_الدوام: " "
        },
        
        
      ]
    };
  },
  components: { LoadingDialog },
  computed: {
    numberOfPages() {
      return Math.ceil(this.items.length / this.itemsPerPage);
    },
    filteredKeys() {
      return this.keys.filter(key => key !== "name");
    }
  },
  methods: {
    nextPage() {
      if (this.page + 1 <= this.numberOfPages) this.page += 1;
    },
    formerPage() {
      if (this.page - 1 >= 1) this.page -= 1;
    },
    updateItemsPerPage(number) {
      this.itemsPerPage = number;
    },
    copy(copyItem) {
      try {
        this.copyText = copyItem;
        if (this.copyText == ".." || this.copyText == ""  ) {
          this.snackbar = true;
          this.snackBarText = "لا يوجد رقم";
          this.snackBarColor = "error";
        } else {
          navigator.clipboard.writeText(this.copyText);
          this.snackbar = true;
          this.snackBarText = "تم نسخ الرقم";
          this.snackBarColor = "success";
        }
      } catch (e) {
        console.log(e);
      }
    }
  }
};
</script>

<style lang="scss">
</style>